---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeTableIterator.IsDone
source: html/3e483f05-93ad-0b13-0dc0-d50e6ec1b6a2.htm
---
# Autodesk.Revit.DB.ExportLinetypeTableIterator.IsDone Method

Identifies if the iteration has completed.

## Syntax (C#)
```csharp
public virtual bool IsDone()
```

## Returns
True if the iteration has no more items. False if there are more items to be iterated.